ХамелионЦРПТ/src/InformationRegisters/МВ_ДополнительныеНастройки/МВ_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВ_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/InformationRegisters/МВ_ДополнительныеНастройки/Forms/ФормаСписка/Module.bsl
// ФТО:ALNA 22.07.2019 30701

#Область ОбработчикиСобытийФормы

//++ ФТО:SOAL 04.10.2019 32239
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПолей = РегистрыСведений.МВ_ДополнительныеНастройки.СписокПолейСРежимомПароль();
	Для Каждого ПолеПароль Из СписокПолей Цикл
		РегистрыСведений.МВ_ДополнительныеНастройки.УстановитьУсловноеОформлениеДляПароля(ЭтаФорма, "Значение", "Список.Значение", "Список.Настройка", ПолеПароль);
	КонецЦикла;	
	
КонецПроцедуры
//-- ФТО:SOAL 04.10.2019

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
		
	Для Каждого Строка Из Строки Цикл
		
		ЭлементФормат = Строка.Значение.Оформление["Значение"].Элементы.Найти("Формат");
		Если ЭлементФормат <> Неопределено Тогда
			
			ЭлементФормат.Значение = РегистрыСведений.МВ_ДополнительныеНастройки.ФорматнаяСтрокаНастройки(Строка.Значение.Данные.Настройка);
			ЭлементФормат.Использование = Истина;
			
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
